0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1e-09;

boundaryField
{
    floatingObj
    {
        type            omegaWallFunction;
        value           uniform 1e-09;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    bottom
    {
        type            omegaWallFunction;
        value           uniform 1e-09;
    }
    outlet
    {
        type            zeroGradient;
    }
    atmosphere
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
