constant/dynamicMeshDict.2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      dynamicMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*mover
{
    type            tableMotion;
    libs            ("libfvMeshMovers.so" "libfvMotionSolvers.so");

    functionObjectLibs ("libsampling.so");
    patches         (geometria.stl);
    tableFile       "motionTable.dat";
    tableType       timeSeparate;
    executeControl  timeStep;
}*/

mover
{
    type            motionSolver;

    libs            ("libfvMeshMovers.so"  "libsixDoFRigidBodyMotion.so");

    motionSolver    sixDoFRigidBodyMotion;   

    functionObjectLibs ("libsampling.so");
    patches         (geometria.stl);
    innerDistance   0;
    outerDistance   90;

    mass                     1; //Need to guaratee that it is not needed else use this in post
    momentOfInertia         (1 1 1); //Need to guaratee that it is not needed else use this in post
    centreOfMass            (0 0 0); //initial pos of cylinder center of gravity

    solver
    {
        type Newmark;
    }

    translationRotation table;
    // interpolationScheme spline;
    file            "motionTable.dat";
}

meshDiffusivityCoeffs
{
    diffusivity     inverseDistance 1 (geometria.stl);
}

// ************************************************************************* //



