constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          ( water air );

transportModel  Newtonian;

nu              nu [ 0 2 -1 0 0 0 0 ] 1.0023e-06;

rho             rho [ 1 -3 0 0 0 0 0 ] 998.19;

sigma           sigma [ 1 0 -2 0 0 0 0 ] 7.28e-2;


// ************************************************************************* //
